[{
    "_id" : ObjectId("541a3655535a850b00b05696"),
    "__v" : 0,
    "assetUrl" : "http://youtu.be/7cWfAOyRYX4",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web.",
        "username" : "hackerpreneur"
    },
    "created" : ISODate("2014-09-18T01:33:09.349Z"),
    "md" : "## 1 Turbo Charged Coding\n\nIn the meantime, here's what I figured out on my own re-writing Coffee Script as Harmony JS.\n\n## 2 Browsify\n\n<iframe width=\"640\" height=\"360\" src=\"//www.youtube-nocookie.com/embed/shevZLVG_us\" frameborder=\"0\" allowfullscreen>\n</iframe>\n\n## 3 Summary\n\nNo change?\n\n[[<script src=\"https://gist.github.com/jkresner/52abc60c665aae0175e5.js\"></script>]]\n\n?sd\nComing soon",
    "meta" : {
        "title" : "Browserify your AngularJS App",
        "canonical" : "https://www.airpair.com/v1/posts/browserify-your-angularjs-app",
        "ogTitle" : "Browserify your AngularJS App",
        "ogImage" : "https://img.youtube.com/vi/7cWfAOyRYX4/hqdefault.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/7cWfAOyRYX4",
        "ogUrl" : "https://www.airpair.com/v1/posts/browserify-your-angularjs-app"
    },
    "published" : ISODate("2015-01-27T01:02:11.289Z"),
    "publishedBy" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
    "slug" : "browserify-your-angularjs-app",
    "tags" : [],
    "title" : "Browserify your AngularJS App",
    "updated" : ISODate("2015-01-02T16:18:39.357Z")
},
{
    "_id" : ObjectId("5422fe882eb2640b00f95d7b"),
    "__v" : 0,
    "assetUrl" : "http://airpair-blog.s3.amazonaws.com/wp-content/uploads/2014/07/swift.png",
    "by" : {
        "bio" : "Over the last few months at AirPair, we've watched the demand for learning Swift rise first-hand. So we've compiled some resources to help developers like you get started with learning and mastering iOS apps with Swift. Below you'll find some of the best Swift Resources available on the web.",
        "name" : "Jonathon Kresner",
        "avatar" : "//0.gravatar.com/avatar/780d02a99798886da48711d8104801a4",
        "gh" : "jkresner",
        "so" : "/users/178211/jonathon-kresner",
        "tw" : "hackerpreneur",
        "gp" : "111546642302857408422",
        "userId" : ObjectId("5181d1f666a6f999a465f280")
    },
    "created" : ISODate("2014-09-24T17:25:28.846Z"),
    "md" : "## 1 Why learn Swift?\n\nIgor Lebovic talks in more depth on how [Swift is a twice in a decade opportunity](http://www.airpair.com/swift/posts/swift-is-a-twice-in-a-decade-opportunity-for-developers). Demand is rising quickly, so getting in early will ensure high paid work.\n\n### 1.1 How to learn Swift\n\nWe've compiled a list of free Swift resources. We've also put together a partnership with One Month to run a 4 week Getting Started with Swift online course aided by AirPair mentoring. And finally, if your company needs Swift training or on-demand pair programing help, [just email us](mailto:team@airpair.com).\n\n## 2 Swift Tutorials\n\nWhether you're ready to build your first production ready Swift app from scratch, \nlearn swift for fun, or get a refresher on Swift syntax - AirPair Experts Jack Watson-Hamblin, Rony Rosen and Garry Morris have you covered.\n\n![Jack Watson-Hamblin](http://gravatar.com/avatar/7a26ff0ae0b5e31a737ab8e4c887f0cf?s=80)\n![Rony Rose](//gravatar.com/avatar/892cdc57a3a64ea0ad59827bc6d1ddf7?s=80)\n![Garry Morris](//gravatar.com/avatar/99dd798c17e2d11678765485f35fea91?s=80)\n\n- Swift from scratch P1 [Basics of Swift in Xcode](/swift/building-swift-app-tutorial)  by Jack Watson-Hamblin \n- Swift from scratch P2 [The Interface Builder, storyboards & structs](/swift/building-swift-app-tutorial-2)  by Jack Watson-Hamblin \n- Swift from scratch P3 [Gluing it together](/swift/building-swift-app-tutorial-3)  by Jack Watson-Hamblin  \n- Learn Swift in One Day [The Ultimate Swift guide](/swift/building-swift-app-tutorial) by Rony Rosen\n- Swift QuickStart [Swift: A Quick Reference Guide](/swift//learning-swift-tutorial) by Garry Morris\n\n## 3 Swift Courses\n\nIf you're serious about Swift,  check out [our partnership with One Month](https://onemonthdev.com/courses/ios), where you can learn Swift in 4 weeks of online classes with One Month and AirPair mentors for $899.\n\n[![One Month Swift Course](http://airpair.github.io/img/2014/09/one-month-swift.png)\n](https://onemonthdev.com/courses/ios)\n\n\n## 4 Help from Swift Developers\n\nAs always, if you need expert help, just [fill out a request](/find-an-expert) and we'll connect you with an on-demand Swift expert.\n\n\n",
    "meta" : {
        "title" : "Learn to code in Swift",
        "canonical" : "http://www.airpair.com/swift/posts/learn-to-code-in-swift",
        "ogType" : "article",
        "ogTitle" : "Learn to code in Swift",
        "ogImage" : "http://airpair-blog.s3.amazonaws.com/wp-content/uploads/2014/07/swift.png",
        "ogVideo" : null,
        "ogUrl" : "http://www.airpair.com/swift/posts/learn-to-code-in-swift",
        "description" : "The best Swift learning resources. Swift articles, Swift tutorials and Swift courses compiles by AirPair."
    },
    "published" : ISODate("2014-09-24T18:17:08.202Z"),
    "publishedBy" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
    "slug" : "learn-to-code-in-swift",
    "tags" : [
        {
            "_id" : ObjectId("52ffea1a1c67d1a4859d2333"),
            "name" : "swift",
            "slug" : "swift"
        }
    ],
    "title" : "Learn to code in Swift",
    "updated" : ISODate("2014-09-27T18:39:59.955Z")
},
{
    "_id" : ObjectId("547b8e8a4dea850b00320ff0"),
    "md" : "Type markdown ...",
    "title" : "Speeding up Node apps for use in realtime situations",
    "tags" : [],
    "updated" : ISODate("2014-11-30T21:39:22.000Z"),
    "created" : ISODate("2014-11-30T21:39:22.105Z"),
    "by" : {
        "name" : "Marco Villaseñor",
        "username" : "mvillasenor",
        "avatar" : "//0.gravatar.com/avatar/297ba641b2e2f2d390812cde249adce9",
        "so" : "/users/4302243/marco-villase%c3%b1or",
        "tw" : "mvillasenor",
        "gp" : "116535226429996578146",
        "bio" : "Marco likes to transform the way people use technology to generate value.  As a specialist in systems integration and collaboration solutions he has helped large enterprises successfuly implement new technologies to solve complex problems.",
        "userId" : ObjectId("53e005ab8f8c80299bcc3e55")
    },
    "__v" : 0
},
{
    "_id" : ObjectId("5497e3adf9d5d80b009d4dde"),
    "md" : "Type markdown ...",
    "title" : "I've seen the light, hallelujah",
    "tags" : [],
    "updated" : ISODate("2014-12-22T09:26:05.000Z"),
    "created" : ISODate("2014-12-22T09:26:05.835Z"),
    "by" : {
        "name" : "Paul Freeman",
        "username" : "mountainman",
        "avatar" : "//0.gravatar.com/avatar/d47bdb6a179c7ebe558e546c8387c831",
        "gp" : "105767977178295220112",
        "bio" : "Software product manager and app developer",
        "userId" : ObjectId("5497bee98f8c80299bcc5768")
    },
    "__v" : 0
},
{
    "_id" : ObjectId("5418ce50cfe1720b004bd08b"),
    "__v" : 0,
    "assetUrl" : "http://youtu.be/wLzS0YC4TXw",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding AirPair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web.",
        "username" : "hackerpreneur"
    },
    "created" : ISODate("2014-09-16T23:57:04.784Z"),
    "md" : "## 1 Why a new AirPair.com?\n\nHi :{} I'm Jonathon, you can follow me on Twitter at [@hackerpreneur](http://twitter.com/hackerpreneur) to keep tabs on my 90-day vision quest to show how powerful AirPairing can be. AirPair is my 3rd startup, and the new AirPair.com code base - which I started today - is the 6th code base I've started from scratch in my startup career. I spent years learning and getting stuck, **so I set out to create a service that would stop people from giving up because of technology** before they could watch their business assumptions play out. We've been lucky to collect a great team, go through YCombinator, and get backing from some amazing Silicon Valley investors. We're excited to be leading our space and to build a next-generation experience that will help us continue as the market leader with the highest quality experts and best customer support.\n\n<br />\n<iframe width=\"640\" height=\"360\" src=\"//www.youtube-nocookie.com/embed/qlOAbrvjMBo\" frameborder=\"0\" allowfullscreen>\n</iframe>\n<br /><br />\nSo far, using AirPair has helped me overcome technology challenges in dribs and drabs. But our ultimate vision of on-demand elastic knowledge has not yet been realized: we see a world where AirPairing makes up as much as 5% of human resources and multiplies software team productivity. \n\nI think the following barriers have gotten in the way of that vision. Now, we're ready to overcome them with a new site and the experience of building it while eating our own dog food.\n\n### 1.1 Cost\n\nI've never had a budget for AirPairing more than 5% of the time. Truth is, AirPair only works when there's a project with a proper development budget. Getting the best people to work with you isn't cheap. You could work with cheaper competitors, but if you are serious about multiplying your productivity, you need to invest in quality help -- like you do with your full-time developers. Now that we have funding, I'm going to use it and show you my spend through the next 90 days.\n\n### 1.2 Friction\n\nThe AirPair experience needs to be 10x faster at getting you help. The current AirPair site is an MVP we built 18 months ago; I'm quite proud of it, and will blog about my philosophy *\"Release Often, Release Dirty\"* another time. But we're ready to give you that order of magnitude improvement on expert response time and matching quality. <a href=\"http://twitter.com/home?status=@hackerprenuer I would love to be a beta tester for the new ap\" target=\"_blank\">Tweet at me</a> if you'd like to be a beta tester. We'll be releasing builds every week for community feedback and bug squashing help.\n\n### 1.3 Dedication\n\nAirPairing is about consuming knowledge at warp speed **while** you see your project come to life. Learning is tiring, and AirPairing properly involves buying in up front with as much dedication as you would when studying a new course. For the last 18 months, I've been context switching between development, marketing, and investor relations. This is the first time I've dedicated 3 straight months of focus to code. I'm switching from Backbone.js and ready to become an AngularJS ninja.\n\n\n## 2 Choosing MEAN Stack \nMean = [`MongoDB, ExpressJS, AngularJS & NodeJS`]\n\n<img src=\"//s3.amazonaws.com/media-p.slid.es/uploads/jbpionnier/images/196683/mean_small_vertical.png\" style=\"margin:40px 40px 30px 0px;float:left\" />\n\nHaving used `MongoDB` for a year, I've grown to like document-driven databases. It's a fast way to develop. I like nesting documents and avoiding joins. It leads to less code, fewer database trips and HTTP requests. There are problems and overhead with replicated data, which may lead us to switch to SQL eventually, but for now Mongo suits our product and development styles really well.\n\nI'm not one for religious debates on which languages to use. I like technologies that `(a)` help you get a lot of shit done quickly and `(b)` lots of people know and are easy to hire for. I came from .NET, where I used to write in c# on the server and various JavaScript on the client side. Full-stack JavaScript with `NodeJS` and `ExpressJS` meant I didn't need to learn a new language and could become doubly proficient in one.\n\nI really love `Backbone.js`, but having tried to teach it to a few people and watch them struggle before grasping `AngularJS` way quicker, I've got a feeling its going to be 3-4 times easier to learn and build on. It's also the most widely adopted and quickly growing front-end framework. I've seen that not only through the notorious graphs of people searching for AngularJS, but first hand with how many requests we get for help with Angular.\n\n## 3 Gulp as an Application Assembler\n\n<img src=\"https://raw2.github.com/gulpjs/artwork/master/gulp-2x.png\" style=\"margin:60px 20px 15% 20px;width:160px;float:right\" />\n\nThe last version of AirPair.com was built using <a href=\"http://brunch.io/\" target=\"_blank\">`brunch.io`</a> as the application assembler to compile, combine, concat and minify JavaScript (coffeescript), CSS (sass) and watch / auto rebuild changes while developing. I really liked it, but a few engineers I worked with didn't. I think the main thing they were annoyed at was needing to restart the brunch server when making server-side changes as it only client-side automatically.\n\nI knew about <a href=\"//gruntjs.com/\" target=\"_blank\">`grunt`</a> as an alternative to brunch, but I'd actually not heard of <a href=\"http://gulpjs.com/\" target=\"_blank\">`gulp`</a> - the latest and greatest. Thanks to a quick chat in my AirPair Angular War Room with my support experts including Matias Nemila (AngularJS Core Team), Uri Shaked (AngularJS Google Developer Expert) and Ari Lerner (Author of ng-book and ng-newsletter), I was quickly pointed in the optimal direction without needing to spend hours on research.\n\nThe main advantages of gulp are code-based configuration vs declarative and streaming (faster) builds. This <a href=\"http://markdalgleish.github.io/presentation-build-wars-gulp-vs-grunt/\" target=\"_blank\">awesome Grunt vs Gulp slide deck</a> by Mark Dalgleish help me appreciate the differences quickly.\n\n### 3.1 nodemon\n`nodemon` is a daemon that watches the JavaScript files in your node app and restarts the node server on any changes. Uri and I installed `gulp-nodemon` in minutes so that the annoyance of manually restarting the node server in my old workflow was gone. I really like that I don't need multiple terminals and multiple commands, everything is taken care of by gulp.\n\n### 3.2 Less\nI ended up opting for Less because you don't need ruby or c++ to compile. With `gulp-less` we got LESS to CSS compilation down relatively quickly, though we got caught on a stylesheet link tag without a `text/css` attribute that held us up for a few minutes.\n\n###3.3 LiveReload\nLiveReload is a mechanism to auto-refresh the browser when a change occurs so you don't have to manually hit refresh. It's particularly nice for CSS editing. I would have fiddled setting this up for quite a while on my own, but Uri knew what he was doing and guided me through setting up both `gulp-livereload` and `connect-livereload` on the node side. I love knocking things out as if I've done it a hundred times before.\n\n##4 Summary\nI'm excited to accomplish a lot in 3 months with the help of AirPair experts on tap. In our first hour of MEAN stack development, Uri and I set up Gulp to wrap nodemon for automatic server-side code reloads, compiling of Less, and browser LiveReload to see client-side changes appear automatically and instantly. This is already a really nice improvement on my previous work flow, and I feel I'm already coding 10% faster for the rest of the project onwards.",
    "meta" : {
        "title" : "Starting a Mean Stack App",
        "canonical" : "http://www.airpair.com/mean-stack/posts/starting-a-mean-stack-app",
        "ogTitle" : "Starting a Mean Stack App",
        "ogImage" : "http://img.youtube.com/vi/wLzS0YC4TXw/hqdefault.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/wLzS0YC4TXw",
        "ogUrl" : "http://www.airpair.com/mean-stack/posts/starting-a-mean-stack-app",
        "description" : "Thoughts and reasons on choosing MEAN stack to rebuild airpair.com with the help of experts."
    },
    "published" : ISODate("2014-08-27T01:20:18.000Z"),
    "publishedBy" : ObjectId("5181d1f666a6f999a465f280"),
    "slug" : "starting-a-mean-stack-app",
    "tags" : [
        {
            "_id" : ObjectId("53c54f5e8f8c80299bcc39bf"),
            "name" : "mean-stack",
            "slug" : "mean-stack"
        },
        {
            "_id" : ObjectId("52d7149c66a6f999a465ff4a"),
            "name" : "gulp",
            "slug" : "gulp"
        }
    ],
    "title" : "Starting a Mean Stack App",
    "updated" : ISODate("2014-10-15T15:47:55.999Z")
},
{
    "_id" : ObjectId("5418d0a3cfe1720b004bd08c"),
    "__v" : 0,
    "assetUrl" : "http://youtu.be/GZess8ZAVAU",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web."
    },
    "created" : ISODate("2014-09-17T00:06:59.550Z"),
    "md" : "## 1 AirPair Development Philosophy\n\nPure best-practices AngularJS challenges some of my combined developer-entrepreneur value set. At AirPair, we code with the following priority order.\n\n1. Revenue generating code\n2. User experience\n3. Best practices & maintainability\n\nWe have some application architecture decisions to make where (1), (2) & (3) can be at odds. Templating architecture is one area where where our prioritization probably conflicts with other developer cultures that may value scalability and reduced complexity higher than revenue.\n\n## 2 Server and client-side templates\n The main issues with server-side vs client-side template architectures are SEO (important for revenue), social sharing of pages (again revenue) and flickering loading experiences of dynamic vs static pages (user experience). I'm very interested to explore the following options with some top notch experts:\n\n### 2.1 Pure client-side templates\nMatias Niemila is an AngularJS core team member. He is championing an application architecture with no server-side templates. There are compelling reasons for this architecture. You can build an extremely efficient data API and then deploy all your client side JavaScript and templates to a CDN which propagates your assets all over the world. You app is effectively as scalable and fast as your data API.\n\n### 2.2 Mixing server and client\nAnother approach is to leverage the best of both worlds by doubling the work. In this architecture part of your app could be deployed on a CDN and the pages that need to be search-indexed or social shared could be served with server-side template by your own servers. The drawbacks of mixed templates are increased complexity. You have to define both server-side and client-side routes that might conflict with each other and you need to know and maintain multiple templates and template languages.\n\n### 2.3 Shared templates\nA cool optimization that gets rid of multiple template languages, and that I had with the previous version of airpair.com was using `handlesbars` as the client-side template language for `Backbone.js` on the client AND with `expressJS` on the server. Thus I was able to thus reuse the exact same templates on both serve and client. I'm not sure if this is possible with AngularJS, but it's something I'd like to look into.\n\n## 3 Setting up AngularJS\n\nTurns out you can get setup in 30 seconds.\n\n### 3.1 Install AngularJS with Bower\n\nPackage managers have become omnipresent in server-side coding. Ruby Gems, nuget, pip, npm - you've heard of them and they're all awesome. Turns out the font-end kids have come up with their own font-end package manager called `bower`. Bower users a `bower.json` file for managing libraries, similar to a `package.json` file for npm / node_modules.\n\nThe `.borwerrc` file tells bower where to install packages. In our case the `public` dir.\n\nInstalling AngularJS took 4 steps:\n\n 1. `npm install bower -g`\n 2. Create `.bowerrc` file\n 3. `bower install angular --save`\n 4. reference angular like `<script src=\"/bower_components/angular/angular.js />`\n\t\n\n### 3.2 Testing AngularJS with karma\nWe didn't get to the point of testing anything during our AirPair session, but I did learn about [`karma`](//karma-runner.github.io/). In airpair.com v0, I used `phantomjs`, a headless web browser to invoke `mocha` to execute integration style tests. Karma replaces that solution with a slightly different approach. Rather than being a headless web browser, karama is a process that launches real browsers like chrome and firefox, runs your tests it, displays the results in you terminal.\n\n### 4 Summary\n\nMatias and I also wrote out my first ever AngularJS feature. We covered some high level concepts pretty quickly that I'll talk about in one of my next posts. I'm really looking forward to being mentored by him daily setting and picking things up much quicker than I would on my own.",
    "meta" : {
        "title" : "Setting up my First AngularJS App",
        "canonical" : "http://www.airpair.com/angularjs/posts/setting-up-my-first-angularjs-app",
        "ogTitle" : "Setting up my First AngularJS App",
        "ogImage" : "http://img.youtube.com/vi/GZess8ZAVAU/hqdefault.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/GZess8ZAVAU",
        "ogUrl" : "http://www.airpair.com/angularjs/posts/setting-up-my-first-angularjs-app",
        "description" : "Thoughts on client-side templates and installing angularJS with bower."
    },
    "published" : ISODate("2014-08-28T01:13:01.000Z"),
    "publishedBy" : ObjectId("5181d1f666a6f999a465f280"),
    "slug" : "setting-up-my-first-angularjs-app",
    "tags" : [
        {
            "_id" : ObjectId("5149dccb5fc6390200000013"),
            "name" : "AngularJS",
            "slug" : "angularjs"
        }
    ],
    "title" : "Setting up my First AngularJS App",
    "updated" : ISODate("2014-09-23T19:14:45.630Z")
},
{
    "_id" : ObjectId("5418d115cfe1720b004bd08d"),
    "__v" : 0,
    "assetUrl" : "http://youtu.be/pE0yd_AW_YI",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web."
    },
    "created" : ISODate("2014-09-17T00:08:53.465Z"),
    "md" : "## 1 Why use ES6 Harmony\nES6 is short for ECMAScript6, which is the blue print for upcoming version of JavaScript. As a language, JavaScript is a double edged sword. It can be freakingly ugly, but at the same time extremely flexible and powerful. JS code is often criticized for having un-necessary redundancy. Thus abstractions like `CoffeeScript` and `TypeScript` became very popular. I personally love writing in CoffeeScript, but CoffeeScript threatens to fragment the JavaScript community, its code bases and package eco-system. So the majority of JavaScript influencers frown upon abstractions and instead opt to patiently help make JavaScript get better. \n\nES6 (code named Harmony) introduces some new JavaScipt language features similar to CoffeeScript. Cleaner iterators (loop syntax), arrow functions, de-structuring assignment and even classes to name a few.\n\n## 2 ES6 features that excite me\n\nI was immediately jazzed to regain the following similar CoffeeScript features within the first hour of having Harmony running:\n\n### 2.1 Cleaner iterator syntax\n\nThank god, no more index and length based looping in my code.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // es6 set style iterator syntax\n    for (var post of posts) {\n    \tconsole.log(post.url);\n    }\n\n### 2.2 Destructuring assignment\n\nDestructuring assigned allows you to pull out attributes on an object ad assigned them to scope level variables in one line. It's especially handy for pulling out separate functions & values from an imported object.\n\n<!--?prettify lang=javascript linenums=false?-->    \n    \n    var post = {\n    \turl: '/first-post',\n    \ttitle: 'My First Post'\n    }\n\n    // es6 de-structuring assignment\n    // Similar to CoffeeScript, but important to use the var\n    var {url,title} = post;\n    \n    console.log('url', url, 'post', post);\n\n### 2.3 Arrow functions\nArrow function in es6 are not as Cool CoffeeScript, but it's better than nothing! There is only a fat arrow function definition (`=>`) and it does not do magic with the function context (`this` variable) like in CoffeeScript. CoffeeScript `(arg) ->` == es6 `(arg) =>`\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // single line arrow functions do not require braces\n    app.get('posts', (req, res) => res.render('/posts.html') );\n\n    // multi line arrow functions require braces\n    app.get('posts', (req, res) => {\n        console.log('in post route');\n        res.render('/posts.html');\n      }\n    );\n\nBraces are required in multi-line functions because unlike CoffeeScript, JavaScript does not care about indentation.\n\n### 3 ES6 Module Pattern\nAs folks starting building large scale JavaScript apps, it became necessary to keep code organized and stop variable from conflicting with each other. This need became amplified when JavaScript matured to the point where apps usually integrating other people's code. `RequireJS` and `CommonJS` module patterns rose up to power most web apps and node respectively. ES6 is the first version of JavaScript that comes with it's own native module loading pattern and syntax. It's definitely one of the biggest features of ES6.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // node (CommonJS) style module export pattern\n    module.exports = {\n    \tinitialize: function() { ... },\n    \trenderPost: function(postName) { ... }\n    }\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // node style module import pattern\n    var blog = require('./blog');\n    blog.initialize();\n    blog.renderPost('hello-world');\n---\n<!--?prettify lang=javascript linenums=false?-->\n\n    // es6 style module export pattern\n    export function initialize() { ... }\n    export function renderPost(postName) { ... }\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // es6 style function import pattern\n    import {initialize,renderPost} from './blog'\n    initialize();\n    renderPost('hello-world');\n\n    // es6 style namespaced import pattern\n    import * as blog from './blog';\n    blog.initialize();\n    blog.renderPost('hello-world');\n\n## 4 Setting up ES6 with NodeJS\nSetting up es6 with node is not as clean as I would have liked. We might be a little bit early adopting Harmony, but our engineering culture is ok with being on the bleeding edge with mainstream technologies. There is a flag you can pass node like `node index.js --harmony` but it only works with the current dev branch of nodejs and which explains why I never got it to work.\n\n### 4.1 es6-module-loader package\nTo get es6 working in nodejs, we can install a package `npm i es6-module-loader -S` and wrap our index.js file in a 'bootstrap' file that imports our app using the es6 module pattern. From there all code inside the import supports es6 features.\n\n<!--?prettify lang=javascript linenums=false?-->\n    \n    // bootstrap.js file\n\n    var System = require('es6-module-loader').System;\n\n    System.import('./index').then(function(index) {\n\t    index.run(__dirname);\n    }).catch(function(err){\n\t    console.log('err', err);\n    });\n\nNote you should tack on the `catch()` promise function so you can see stack errors. \n\nOnce we setup our `boostrap.js` file, we no longer start our app with `node index.js` but instead use:\n\n    node boostrap.js\n\n### 4.2 appdir vs __dirname\nThe ES6 module system mixes up the normal `__dirname` node variable, so you can't gracefully mix and match ES6 styles imports with require syntax and use consistent relative paths. To get around this Uri showed me a solution to pass in the __dirname value from the bootstrap code (above) and add it (in index.js) onto our express app object for later reference like so:\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    export function run(appdir)\n    {\n\t    var express = require('express');\n\t    var app = express();\n\t    app.dir = appdir;\n\t    ...\n\t    app.use(express.static(app.dir + '/app'));\n\t    ...\n    }\n\n\n### 5 Summary\n\nI was really keen to embrace ECMAScript6. I'd had fooled around trying to set it up myself for 30 minutes and got nowhere. Uri Shaked helped me understand the bootstrapping process in 10 minutes. I know it would have taken me more than an hour. With these cutting edge scenarios, it feels great to leverage someone else's fiddling time to save my own. It was also really fun to feel my expert enjoying what we were setting up just as much as I did.\n",
    "meta" : {
        "title" : "Using ES6 Harmony with NodeJS",
        "canonical" : "http://www.airpair.com/javascript/posts/using-es6-harmony-with-nodejs",
        "ogTitle" : "Using ES6 Harmony with NodeJS",
        "ogImage" : "http://img.youtube.com/vi/pE0yd_AW_YI/hqdefault.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/pE0yd_AW_YI",
        "ogUrl" : "http://www.airpair.com/javascript/posts/using-es6-harmony-with-nodejs",
        "description" : "Boostrapping your node app with ES6 features and modules."
    },
    "published" : ISODate("2014-09-01T07:28:04.000Z"),
    "publishedBy" : ObjectId("5181d1f666a6f999a465f280"),
    "slug" : "using-es6-harmony-with-nodejs",
    "tags" : [
        {
            "_id" : ObjectId("514825fa2a26ea020000001f"),
            "name" : "javascript",
            "slug" : "javascript"
        },
        {
            "_id" : ObjectId("514825fa2a26ea0200000028"),
            "name" : "node.js",
            "slug" : "node.js"
        }
    ],
    "title" : "Using ES6 Harmony with NodeJS",
    "updated" : ISODate("2014-09-23T19:16:40.804Z")
},
{
    "_id" : ObjectId("5418d183cfe1720b004bd08e"),
    "__v" : 0,
    "assetUrl" : "http://youtu.be/JfBybnBmzTw",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web.",
        "username" : "hackerpreneur"
    },
    "created" : ISODate("2014-09-17T00:10:43.547Z"),
    "md" : "## 1 A Pure AngularJS Feature\n\nTo get totally into Angular, I've decided to build a whole feature \"Singing up to Attend Workshops\" in pure AngularJS with no server-side templates. The feature set includes:\n\n1. Seeing info about a workshops\n - before talk => Show Slide & Countdown Timer\n - after talk => Show Recording\n2. Getting the user to take action depending on if the user has 'access' and 'RSVPed'\n - no access => Flow to get AirPair membership\n - have access, but not rsvp'ed => Flow to RSVP\n - have access, already rsvp'ed => Show they are attending\n\nToday's goal was to show a workshop's title + description using a mocked API Workshop response.\n\n## 2 First AngularJS Lessons\n\nWe covered the following AngularJS concepts to get things working.\n\n### 2.1 ng-app and Angular Modules\n\nAngular code is generally packaged into AngularJS modules. The Angular module system has it's own unique Dependency Injection pattern. To link an html page to code (a module, probably with some controllers and routes), use the `ng-app` attribute on the html declaration. \n\n<!--?prettify lang=html linenums=false?-->\n\n    <!DOCTYPE html>\n    <html ng-app=\"APWorkshops\">\n    <head>\n\n<!--?prettify lang=javascript linenums=true?-->\n\n    angular.module(\"APWorkshops\", ['ngRoute'])\n\n    .run(['$rootScope', function($rootScope) {\n\t  \t$rootScope.title = 'Hello Airpair';\n    }])\n\n    .controller('WorkshopsCtrl', function($scope) {\n      $scope.entries = []; \n    })\n\n    .controller('WorkshopCtrl', ['$scope', '$http', '$routeParams', function($scope, $http, $routeParams) {\t\n      $http.get('/api/workshops/'+$routeParams.id).success(function (data) {\n        $scope.entry = data;\n      });\n    }])\n\n    .config(function($routeProvider) {\n\t\t\n      $routeProvider.when('/', {\n\t      templateUrl: '/workshops/list.html',\n\t      controller: 'WorkshopsCtrl as workshops'\n      });\n\n      $routeProvider.when('/:id', {\n\t      templateUrl: '/workshops/show.html',\n\t      controller: 'WorkshopCtrl as workshop'\n      });\n\n    });\n\n### 2.2 AngularJS Routing\n\nTo get started with angular routes install angular route `bower i angular-route -S`\n\nRoutes map (client-side) urls to templates and controllers. When a route is hit, Angular will automatically invokes the controller function and shows the configured template.\n\nIt's really nice ti pair with an Angular Core Team member, as I was informed that there will be a new Angular Router  released a few weeks. Hence I won't dive in any more detail.\n\n`$routeParams` is the mechanism that allows us to pull variables out from our urls. You can see it used on line 12.\n\n### 2.3 AngularJS Controllers & $scope\n\nUnlike <i>BackboneJS</i> Views, which are some form of hybrid ViewController, Angular controllers feel like more pure controllers. They're like a Rails controllers, but instead of database calls you make network requests. One big difference is that AngularJS controllers don't return some kind of result to format/render the data. Instead you focus only on changing the local `$scope` (or self) object.\n\nWhen ever you make a change the $scope object, angular automatically updates the templates for you. You don't even need to wire up event listeners like in BackboneJS. At first glance you might think, Angular updates on a polling mechanism, but it doesn't. Instead the framework has various hooks to *check in* when things like http calls happen. This is one reason why angular uses its own `$http` mechanism rather than `jquery.ajax`.\n\n`$rootScrope` is a special scope that is accessible in all controllers and all templates.\n\n### 3 First client + server route conflicts\n\nAt the end of the session, we were struggling to get the workshops index.html page loading. After debugging solo for half an hour afterwards, there were multiple issues going on.\n\n1. We had set the node app directory to load static resources. This lead to the confusing behavior of automatically opening `/app/workshops/index.html` our client side list view template, instead of `/app/workshops/workshops.hbs` the \"index html file\" of our SPA.\n2. The angular route definitions had to be changes from `/workshops` & `/workshop/:id` to just `/` and `/:id` which might not feel immediately intuitive.\n\n### 4 AngularJS then() vs success() promise\n\nThe last thing I got caught on before achieving my mission was using the `then()` promise instead of `success()` on return of our API request. They return slightly different objects, i.e. a request vs pure data, so if using then you need to access the 'response.data' attribute of the result.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n      $http.get('/api/workshops/'+$routeParams.id).then(function (response) {\n        $scope.entry = response.data; // Here we need to access .data\n      });\n\n      $http.get('/api/workshops/'+$routeParams.id).success(function (data) {\n        $scope.entry = data;\n      });  \n\n\n### 5 Summary\n\nThings so far seem pretty simple with a couple of gotchas. Ready to step it up tomorrow.",
    "meta" : {
        "title" : "Getting started with AngularJS 1.3",
        "canonical" : "http://www.airpair.com/angularjs/posts/getting-started-with-angularjs-1.3",
        "ogTitle" : "Getting started with AngularJS 1.3",
        "ogImage" : "http://img.youtube.com/vi/JfBybnBmzTw/hqdefault.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/JfBybnBmzTw",
        "ogUrl" : "http://www.airpair.com/angularjs/posts/getting-started-with-angularjs-1.3",
        "description" : "Building a mini app with Angular 1.3"
    },
    "published" : ISODate("2014-09-02T08:29:53.000Z"),
    "publishedBy" : ObjectId("5181d1f666a6f999a465f280"),
    "slug" : "getting-started-with-angularjs-1.3",
    "tags" : [
        {
            "_id" : ObjectId("5149dccb5fc6390200000013"),
            "name" : "AngularJS",
            "slug" : "angularjs"
        }
    ],
    "title" : "Getting started with AngularJS 1.3",
    "updated" : ISODate("2014-09-23T19:16:58.197Z")
},
{
    "_id" : ObjectId("541a212ddada9a0b009c6356"),
    "__v" : 0,
    "assetUrl" : "http://i.huffpost.com/gen/1164240/thumbs/o-GRUMPY-CAT-MOVIE-facebook.jpg",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web.",
        "username" : "hackerpreneur"
    },
    "created" : ISODate("2014-09-18T00:02:53.633Z"),
    "md" : "## 1 Wasting Coding Time\nIf you're a developer, you're going to empathize with my mood today. I spent 3 hours rewriting the old airpair.com API from CoffeeScript to ES6 JavaScript... and failed.\n\nWe all become Angry Cat every now and then. Its worse if your coding for yourself, rather than on someone else's dime. And more frustrating when you've promised a feature to your users and you know you're going to be late.\n\nToday I was too stubborn to AirPair. I know why, I've had this feeling before. You get to a mind state where you decide, *\"I just need to figure it out ON MY OWN so I don't feel stupid!\"*\n\n3 hours later, I feel stupid for not getting help. I blame it partly on my pride and partly on the limitations of the way AirPair currently works. I'm even more determined now to create the interaction I needed today to make it so easy to AirPair, I will do it every time I even get close to today's mind state.\n\nIn the meantime, here's what I figured out on my own re-writing Coffee Script as Harmony JS.\n\n## 2 Migrating CoffeeScript to ES6\n\nHere's some of the CoffeeScript I was to migrating. I got a lot of mileage from some class inheritance and heavy reliance on CoffeeScript fat arrows `=>`. Fat arrows in Coffee preserve `this` within the different functions of a class. I miss them SO MUCH! \n\n<!--?prettify lang=coffeescript linenums=true?-->    \n\n    class BaseApi\n      \n      logging: off\n      \n      # Constructor for creating business logic service \n      Svc: -> $log \"override in child class\"\n\n      # Read routes handled by this Api instance\n      constructor: (app) ->\n        @routes app\n\n      # Override routers in each child class\n      routes: (app) ->\n\n      # Handle results consistently and DRY\n      cSend: (res, next) ->\n        (e, r) =>\n          if @logging then $log 'cSend', e, r\n          if e && e.status then return res.send(400, e)\n          if e then return next e\n          res.send r\n\n      # AirPair Api middleware\n      ap: (req, res, next) =>\n        # Instantiate business layer service with user context\n        @svc = new @Svc req.user\n\n        # Create the callback to send the response\n        @cbSend = @cSend res, next\n    \n        # dump info about the request if logging is on\n        if @logging\n          console.log req.url, req.body\n\n        # finally, call next callback in the middleware chain\n        next()\n\n      # Default http operations\n      create: (req) => @svc.create req.body, @cbSend\n      list: (req) => @svc.getAll @cbSend\n      detail: (req) => @svc.getById req.params.id, @cbSend\n\n\n\n<!--?prettify lang=coffeescript linenums=true?-->    \n\n    class WorkshopsApi extends require('./_api')\n\n      Svc: require './../services/workshops'\n\n      routes: (app) ->\n        app.post  \"/adm/workshop\", @ap, @create\n        app.get  \"/adm/workshop\", @ap, @list\n        app.get  \"/adm/workshop/:id\", @ap, @detail\n\n\n\n## 3 CoffeeScript to ES6 Tips\n\nThe following lessons are by no means an exhaustive or perfected discussion. Just what I learned mucking around today and where my knowledge is at.\n\n### 3.1 Arrow Functions\n\nES6 JavaScript has no thin arrow function `->`. Essentially, CoffeeScript `->` == ES6 `=>`. There is no equivalent CoffeScript fat arrow function, and if you got lazy like me, you're going to have to change a lot if you're coming back from the dark side.\n\n![Dark Side Cat](//www.starwarscats.com/wp-content/uploads/2013/01/darth-vader-cat.jpg) \n\nThe other gotchas, that you'll get used to in a couple of days are (1) needing braces around multi-line functions (e.g. line 2 and 10 + line 4 and 9), and (2) remembering to use the `return` keyword.\n\n<!--?prettify lang=javascript linenums=true?-->   \n    \n    cbSend(fn) {\n      return (req, res, next) => {\n        $log('inner.req', req)\n        fn( (e , r) => {\n          if (logging) { $log('cbSend', e, r) }\n          if (e && e.status) { return res.send(400, e) }\n          if (e) { return next(e) }\n          res.send(r)\n        })\n      }\n    }\n\nYou also might get initially tripped up on the function syntax in-side of classes.\n\n<!--?prettify lang=javascript linenums=true?-->   \n\n    // normal es6 function\n    cbSend = (fn) => {\n      ...\n    }\n    \n    // function definition in a class\n    cbSend(fn) {\n      ...\n    }\n\n### 3.2 ES6 Destructuring Assignment\n\nES6 Destructuring Assignment has a bit more going on than CoffeeScript Descructuring Assignment. For example you can use it to Destructure arrays. Largely you can use it almost the same. Though I found two Gotchas today. (1) you need to start using the var keyword.\n\n<!--?prettify lang=javascript linenums=true?-->   \n\n    // Doesn't work\n    {body,params} = req\n    \n    // Works\n    var {body,params} = req\n\n(2) ES6 Destructuring Assignment returns `undefined` when attributes on an object don't exist, where CoffeScript Destructuring Assignment returns `null`\n\n\n### 3.3 ES6 Classes\n\nThis is as far as I got with converting my classes. I'm seriously wondering if I need to embrace functional programming and move away from Object inheritance after all these years.\n\nI've gone ahead and commented the differences in-line. But the main limitation is no longer being able to think of everything inside your class sharing the same `this` context. It's a really bit deal, be prepared!\n\n<!--?prettify lang=javascript linenums=true?-->   \n\n    // Put logging on outer scope because 'this' isn't necessarily\n    // available from one class function to the next\n    var logging = false\n\n    class BaseApi {\n      \n      constructor(app) {\n        this.routes(app)\n      }\n\n      routes(app) { $log('override in child class') }\n\n      // A bit more complicated than coffee version because we\n      // Can't cheat with this context\n      cbSend(fn) {\n        return (req, res, next) => {\n          fn( (e , r) => {\n            if (logging) { $log('cbSend', e, r) }\n            if (e && e.status) { return res.send(400, e) }\n            if (e) { return next(e) }\n            res.send(r)\n          })\n        }\n      }\n\n    }\n\n<!--?prettify lang=javascript linenums=true?-->   \n\n    import WorkshopsService from '../services/workshops'\n\n    class WorkshopsApi extends BaseApi {\n\n      // Need to define child constructor and call super because\n      // we don't have class attributes like ln 3 in Coffee Version\n      constructor(app) {\n        var user = null // haven't yet figured out how to get user off req\n        this.Svc = new WorkshopsService(user)\n        super(app)\n      }\n\n      routes(app) {\n        app.get( '/workshops/', this.list(this) )\n        app.get( '/workshops/:slug', this.detail(this) )\n      }\n\n      //-- We have to pass self, as 'this' is taken from middleware chain\n      list(self) {\n        return self.cbSend( self.svc.getAll )\n      }\n\n      //-- Didn't figure this a nice was to do detail yet :{}\n      detail(self) {\n        return (req, res, next) => {\n          var slug = req.params.slug\n          self.svc.getBySlug(slug, (e , r) => {\n            if (e && e.status) { return res.send(400, e) }\n            if (e) { return next(e) }\n            res.send(r)\n          })\n        }    \n      }\n    }\n\n\n### 4 Summary\n\nTo be honest, I don't know if I'm missing a few bits of knowledge to make this awesome, or if what I'm trying to do was a waste of time from the start. I probably should have just build this whole piece with an AirPair and saved my Dark Kat coming out.",
    "meta" : {
        "title" : "Migrating CoffeeScript to ES6 JavaScript",
        "canonical" : "http://www.airpair.com/coffeescript/posts/migrating-coffeescript-to-es6-javascript",
        "ogTitle" : "Migrating CoffeeScript to ES6 JavaScript",
        "ogImage" : "https://i.huffpost.com/gen/1164240/thumbs/o-GRUMPY-CAT-MOVIE-facebook.jpg",
        "ogVideo" : "https://www.youtube-nocookie.com/v/http://i.huffpost.com/gen/1164240/thumbs/o-GRUMPY-CAT-MOVIE-facebook.jpg",
        "ogUrl" : "http://www.airpair.com/coffeescript/posts/migrating-coffeescript-to-es6-javascript",
        "description" : "Tips and tricks for moving from CoffeeScript to ES6"
    },
    "published" : ISODate("2014-09-04T17:20:11.879Z"),
    "publishedBy" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
    "slug" : "migrating-coffeescript-to-es6-javascript",
    "tags" : [
        {
            "_id" : ObjectId("514825fa2a26ea0200000011"),
            "name" : "coffeescript",
            "slug" : "coffeescript",
            "sort" : 1
        },
        {
            "_id" : ObjectId("514825fa2a26ea020000001f"),
            "name" : "javascript",
            "slug" : "javascript",
            "sort" : 0
        }
    ],
    "title" : "Migrating CoffeeScript to ES6 JavaScript",
    "updated" : ISODate("2014-12-29T01:55:36.651Z")
},
{
    "_id" : ObjectId("541a36c3535a850b00b05697"),
    "__v" : 0,
    "assetUrl" : "http://airpair.github.io/img/2014/10/passportjs.png",
    "by" : {
        "userId" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
        "avatar" : "//0.gravatar.com/avatar/19183084115c4a79d34cdc3110adef37",
        "twitter" : {},
        "stack" : {},
        "name" : "Jonathon Kresner",
        "linkedin" : {},
        "google" : {},
        "github" : {},
        "bitbucket" : {},
        "bio" : "Jonathon Kresner is AirPair's CEO and Founder. He conceived AirPair to help developers build ideas faster and stay un-stuck. He's decided to put AirPair to the test, by rebuilding airpair.com from scratch in 90 days with daily help from the best AngularJS, NodeJS and MongoDB experts on the web.",
        "username" : "hackerpreneur"
    },
    "created" : ISODate("2014-09-18T01:34:59.747Z"),
    "md" : "## 1 Stuck on ExpressJS Middleware\n\nI'm excited to write this post because I was stuck for 6 hours on middleware issues while settings up PassportJS. I wish I could have accessed the right expert, but AirPair hasn't yet scaled to be quick enough in many niche cases like this one. In an ironically good way, my frustrations reminded me how important our mission is. Thousands like myself get stuck daily. Saving people time is AirPair's mission and one day soon, we'll be able connect you with the right person for ANYTHING in less than half an hour. \n\nUntil then, if you're setting up a new app with PassportJS, I hope this post helps. There's lots of good stuff in here. The main take away is to watch out for is **the order you add ExpressJS Middleware** to your app. As I'll cover more than once below, a tiny swap in middleware order can have HUGE consequences.\n\n## 2 Understanding ExpressJS & PassportJS\n\nThough I've setup ExpressJS and PassportJS before, in the old airpair.com app, I didn't deeply understand each. There are currently some 10,000,000 active session documents in the old app's MongoDB instance, which is obviously not right. Luckily it hasn't effected us in a material way, but I'm sure it would eventually. So I spent some time observing how Express and PassportJS plug into each other, here's what I learned on the way to uncovering what was going wrong.\n\n### 2.1 There is only One Session\n\nAs [per the passport docs](http://passportjs.org/guide/configure/) configuring Passport looks something like this:\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    app.configure(function() {\n      app.use(express.static('public'));\n      app.use(express.cookieParser());\n      app.use(express.bodyParser());\n      app.use(express.session({ secret: 'keyboard cat' }));\n      app.use(passport.initialize());\n      app.use(passport.session());\n      app.use(app.router);\n    });\n\nThe syntax is a bit misleading I think... The first thing to conceptually get your head around is that even though you configure `express.session()` and`passport.session()`, there is really only one session, which is managed by Express. Passport merely piggy backs off the ExpressJS session to store data for authenticated users. Let's take a look.\n\n### 2.2 Express `req.session`\n\n`req.session` is just a json object that gets persisted by the `express-session` middleware, using a store of your choice e.g. Mongo or Redis. Logging to the terminal, you'll see a default session object looks something like:\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    req.session = { cookie: \n      { path: '/',\n        _expires: Thu Nov 07 2014 09:39:45 GMT-0700 (PDT),\n        originalMaxAge: 100000,\n        httpOnly: true } }\n\nIf you open up your persistence store and look at the documents, you'll see the req.session object is an attribute of the the entire document that also comes with an `id` and `expires` attribute.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    {\n        _id : \"svZGs99EIvDkwW_60PRwlafU9Y_7_m-N\",\n        session : { cookie:{originalMaxAge:100000,expires:\"2014-11-07T02:11:16.320Z\",httpOnly:true,path:\"/\"},\n        expires : ISODate(\"2014-11-07T02:11:16.320Z\")\n    }\n\nExpress stuffs the id of the session object into a cookie on the clients browser, which gets passed back to express in a header on every request. This is how express identifies multiple requests as belonging to a single session even if they're not a logged in user. With the id from the cookie header, express reads the session store and puts all the info onto req.session, available for you on each request.\n\n### 2.3 Harnessing `req.session` yourself\n\nYou can stuff anything you like onto the req.session object and express will persist it automatically back to the session store for a given session (unique id). for example if a user can't access a page because they are not logged in, airpair.com uses a custom made up attribute called `return_to` to direct the user to the right page after login. \n\n<!--?prettify lang=javascript linenums=true?-->\n\n    { cookie: \n      { path: '/',\n        _expires: Thu Oct 09 2014 09:39:45 GMT-0700 (PDT),\n        originalMaxAge: 100000,\n        httpOnly: true },\n        passport: { user: { _id: '5175efbfa3802cc4d5a5e6ed' } },\n        return_to: '/workshops' }\n\nIt's worth noting, if you can conceptualize now that you can put anything you want into an anonymous session, so long as you can correlate an anonymous session to a user in your database on login or signup, you can start persisting info for a user even though you don't know who they are straight away. You will see some cool interactions for anonymous users on airpair.com coming in the next month or two.\n\n### 2.4 Passport also harnesses `req.session`\n\nAs you can see above on line 6 in the code snippet above, using the `passport` attribute, PassportJS also uses the session object to keep track of a logged in user  associated with a given session. \n\nIt then uses the deserializeUser function which receives the req.session.passport.user object as it's first parameter, and as the default behavior suggested in the PassportJS documentation, makes an additional read to your persistence store to retrieve the user object associated with the userId.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    passport.serializeUser(function(user, done) {\n      done(null, user.id);\n    });\n\n    passport.deserializeUser(function(id, done) {\n      User.findById(id, function(err, user) {\n        done(err, user);\n    });\n\n#### 2.4.1 Passport `req.user`\n\n`req.user` is a PassportJS specific property that is the result of the `deserializeUser` function using the data from `req.session.passport.user`\n\n#### 2.4.2 Optimization 1\n\nI realized that in the old app, we followed the default suggestion and were hitting the database twice on every single API call to populate all the users' information in memory. But in practice, we rarely needed more than the userId in our backend code. So this time round, I've made the decision to stuff the name and email into the session object and avoid making multiple database trips on every single api call. With many pages on the site making 5-10 calls to render a single page, this seemed like a cheap way to significantly reduce database load. Here's what the new app looks like:\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    passport.serializeUser( (user, done) => {\n      var sessionUser = { _id: user._id, name: user.name, email: user.email, roles: user.roles }\n      done(null, sessionUser)\n    })\n\n    passport.deserializeUser( (sessionUser, done) => {\n      // The sessionUser object is different from the user mongoose collection\n      // it's actually req.session.passport.user and comes from the session collection\n      done(null, sessionUser)\n    })\n\n### 2.5 When are sessions created?\n\nExpress will create a new session (and write it to the database), whenever it does not detect a session cookie. Turns out, the order you set the session middleware and tell express where your static directory is, has some pretty dramatic nuances. Here's what the new AirPair index.js looks like:\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    var express = require('express')\n    var app = express()\n\t\n    //-- We don't want to serve sessions for static resources\n    //-- Save database write on every resources\n    app.use(express.static(config.appdir+'/public'))\n\n    mongo.connect()\n    session(app, mongo.initSessionStore)\n\n    //-- Do not move connect-livereload before session middleware\n    if (config.livereload) app.use(require('connect-livereload')({ port: 35729 }))\n\t\n    hbsEngine.init(app)\n    routes.init(app)\t\n    app.listen(config.port, function() {})\n\n#### 2.5.1 Optimization 2\n\nTurns out, if you add the session middleware before your static directory, Express with generate sessions for requests on static files like .css, images and JavaScript. \n\nIf a new visitor without a session loads a page with 10 static files, the clients browser will not yet have a cookie and will send 10 cookieless requests all triggering express to create sessions. Owch! So that's what was happening... If you haven't done something smart to detect bots and scrapers, things can blow out pretty quickly!\n\nSimply put your static files first, or even better on a CDN that has nothing to do with your node app and your session collection should stay much healthier.\n\n### 2.6 ExpressJS 4.0 Middleware Order\n\nThe middleware setup for ExpressJS 4.0 is quite different from ExpressJS 3.0 where everything came baked in. You now need to include each piece manually with it's own NPM package. In case you want to see an up to date version of how each  piece is chained together, because there are many non-working legacy examples floating around, this is what I ended up with.\n\nCouple of gotchas that sunk half an hour or so for me, include that Cookie Parser now requires a secret and Body Parser required and Extend Url.\n\n<!--?prettify lang=javascript linenums=false?-->\n\n    // Passport does not directly manage your session, it only uses the session.\n    // So you configure session attributes (e.g. life of your session) via express\n    var sessionOpts = {\n      saveUninitialized: true, // saved new sessions\n      resave: false, // do not automatically write to the session store\n      store: sessionStore,\n      secret: config.session.secret,\n      cookie : { httpOnly: true, maxAge: 2419200000 } // configure when sessions expires\n    }\n\n    app.use(bodyParser.json())\n    app.use(bodyParser.urlencoded({extended: true}))\n    app.use(cookieParser(config.session.secret))\n    app.use(session(sessionOpts))\n\n    app.use(passport.initialize())\n    app.use(passport.session())\n\n\n## 3 The AHA! Damn freaking live-reload\n\nSo it turns out, the problem that held me up was the position of the live-reload middleware. LiveReload injects script into every response to listen for changes emitted from the server. I don't know the exact issue, but having it before the session middleware, broke the session cookie being sent correctly to the client.\n\n## Conclusion\n\nI'm glad I took the time to dive deep with Express and Passport for the new airpair.com site. A few tweaks have lead to significantly less database traffic and my deepening understanding of how to utilize req.session will empower us to build some cool interactions and personalization for anonymous visitors.",
    "meta" : {
        "title" : "ExpressJS and PassportJS Sessions Deep Dive",
        "canonical" : "http://www.airpair.com/express/posts/expressjs-and-passportjs-sessions-deep-dive",
        "ogType" : "article",
        "ogTitle" : "ExpressJS and PassportJS Sessions Deep Dive",
        "ogVideo" : null,
        "ogUrl" : "http://www.airpair.com/express/posts/expressjs-and-passportjs-sessions-deep-dive",
        "description" : "Misunderstanding ExpressJS Sessions and how PassportJS works can lead to millions of un-necessary database reads and writes. This deep time will keep you out of trouble.",
        "ogDescription" : "Misunderstanding ExpressJS Sessions and how PassportJS works can lead to millions of un-necessary database reads and writes. This deep time will keep you out of trouble.",
        "ogImage" : "http://airpair.github.io/img/2014/10/passportjs.png"
    },
    "published" : ISODate("2014-09-23T19:17:23.161Z"),
    "publishedBy" : ObjectId("5175efbfa3802cc4d5a5e6ed"),
    "slug" : "expressjs-and-passportjs-sessions-deep-dive",
    "tags" : [
        {
            "_id" : ObjectId("514825fa2a26ea0200000016"),
            "name" : "ExpressJS",
            "slug" : "express"
        },
        {
            "_id" : ObjectId("5181e12e66a6f999a465f282"),
            "name" : "passport",
            "slug" : "passport"
        }
    ],
    "title" : "ExpressJS and PassportJS Sessions Deep Dive",
    "updated" : ISODate("2014-10-16T14:26:46.408Z")
}
]
